# -*- coding: utf-8 -*-
from string import Template

### Службові налаштування ###
BOT_TOKEN = "" # Токен бота. Необхідно вказати для роботи
DATABASE_FILE = "bot_base.db" # Адреса бази даних. Не змінюйте, якщо не певні у тому, що робите!
DATETIME_FORMAT = "%Y-%m-%d %H:%M:%S" # Формат виведення дати та часу.
HACKING_ALLOWED = True # Вказує, чи активний додатковий модуль "хакінгу". Вкажіть True для ввімкнення, False для вимкнення
DEFAULT_FINANCES = 1000

### Налаштування текстів службових повідомлень ###
WELCOME_MESSAGE = "Вітаю! Я - LARP Banking Bot, перший неспецифічний бот для банкінгу у рольових іграх живої дії на базі платформи Telegram; введіть /help для інструкцій"
HELP_MESSAGE = """
    Дужки вказані для виділення; у команді потрібно вказувати значення без дужок
    Загальні команди:
    /start - прочитати привітання
    /help - довідка/список загальних команд
    /admin_help - довідка/список адміністративних команд
    /hacker_help -  довідка/список хакерських команд
    /register [ім'я персонажа] - реєстрація персонажа (1 персонаж на 1 користувача на 1 гру)
    /inspect - дані про персонажа (якщо його зареєстровано)
    /message [хеш персонажа] [текст повідомлення] - передати повідомлення через бота (підписане хешем вашого персонажа)
    /list_sent - вивести список надісланих транзакцій 
    /list_recieved - вивести список отриманих транзакцій  
    /send [хеш персонажа] [сума] - надіслати вказану суму персонажу з вказаним хешем з рахунку свого персонажа

"""
ADMIN_HELP_MESSAGE = """
    Дужки вказані для виділення; у команді потрібно вказувати значення без дужок
    /create_admin - створення адміністративного користувача (якщо його ще не існує)
    /delete [хеш персонажа] - видалення персонажа
    /inspect_all - дані про всіх зареєстрованих персонажів гри
    /set_attribute [хеш персонажа] [назву атрибуту; одне зі списку - finances|hacker_level|hacker_defence|is_admin] [нове значення атрибуту] - встановити атрибут персонажа рівним значенню
"""
HACKER_HELP_MESSAGE = """
    Дужки вказані для виділення; у команді потрібно вказувати значення без дужок
    УСІ хакерські команди, якщо рівень хакерських здібностей ВАШОГО персонажа нижче або рівний за рівень захисту цілі, ПОВІДОМЛЯТЬ ціль про злам/повідомлення
    /h@ck_user [хеш персонажа] - отримайте дані про профіль вказаного персонажа
    /h@ck_list_recieved [хеш персонажа] - вивести список отриманих транзакцій для обраного персонажа
    /h@ck_list_sent [хеш персонажа] - вивести список надісланих транзакцій для обраного персонажа
    /mess@ge [хеш персонажа] [текст повідомлення] - надішліть анонімне повідомлення персонажу
"""

### Налаштування текстів помилок та повідомлень про заборону ###
NO_USER_ERROR = "Персонажа з таким хешем не знайдено у базі даних"
NO_HACKER = "Недостатній рівень доступу; потрібні хакерські здібності персонажа"
NO_ADMIN_ERROR = "Недостатній рівень доступу; потрібні повноваження адміністратора (майстра гри)"
ALREADY_ADMIN = "У цій базі даних уже зареєстровано адміністратора. Зверніться до адміністратора для підвищення рівня повноважень"
ADMIN_RECORD_CREATED = "Користувача-адміністратора створено. Ім'я персонажа: ADMIN, хеш персонажа: 0000000000"
ALREADY_REGISTERED = "У базі даних цієї гри уже зареєстровано персонажа на ваш юзернейм у Telegram. Введіть /inspect для деталей"
NO_NAME = "Необхідно вказати ім'я персонажа"
ATTRIBUTE_UPDATE_MESSAGE = "Значення обраного атрибуту оновлено"
TRANSACTION_NO_FINANCES = "Транзакцію не проведено: недостатньо фінансів на рахунку"
TRANSACTION_NO_USER = "Транзакцію не проведено: не знайдено отримувача"
MESSAGE_SEND_RESULT = "Надіслано повідомлення"
INCOMING_MESSAGE = "Надходить повідомлення"
USER_DATA = "користувача"
SENT_TRANSACTIONS_DATA = "надіслані транзакції"
RECIEVED_TRANSACTIONS_DATA = "отримані транзакції"
NO_USERS_FOUND = "Немає даних про користувачів"
NO_USER_DATA = "Немає даних про персонажа"
NO_TRANSACTIONS_FOUND = "Немає транзакцій"
ATTRIBUTE_UPDATE_MESSAGE = "Вказаний атрибут персонажа оновлено"
ALREADY_HAVE_USER = "Персонажа з таким ім'ям уже зареєєстровно"

### Налаштування текстів з динамічно генерованими даними. НЕ ЗМІНЮЙТЕ змінні виду $name ###
REGISTRATION_MESSAGE = Template("Вашого персонажа зареєстровано. Ім'я персонажа: $character_name; хеш персонажа: $character_hash")
DELETION_MESSAGE = Template("Персонажа с хешем $character_hash було видалено")
TRANSACTION_MESSAGE = Template("Транзакцію підтверджено; від $sender_hash до $reciever_hash, на суму: $amount; хеш транзакції: $transaction_hash")
HACK_ALERT = Template("ПОПЕРЕДЖЕННЯ! Ваші дані про $data_type потрапили у руки до $hacker_hash")
USER_MODEL_DATA = Template(
    "Ім'я персонажа: $character_name;\nХеш персонажа: $character_hash;\nДоступні фінанси: $finances;\nРівень хакерських здібностей: $hack_level;\nРівень захисту від зламу: $defence_level;\nСтворено: $created"
)
TRANSACTION_MODEL_DATA = Template(
    "Хеш транзакції: $transaction_hash;\nсума транзакції: $amount;\nчас створення транзакції: $created;\nнадіслано від $sender_hash => $reciever_hash"
)
